src/Catalogs/уатУчетныеЗаписиСистемыМониторинга/уатУчетныеЗаписиСистемыМониторинга.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>уатУчетныеЗаписиСистемыМониторинга</name>
  <comment>(уат)</comment>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Omnicomm</name>
      <description>Omnicomm</description>
    </items>
    <items>
      <name>Wialon</name>
      <description>Wialon</description>
    </items>
    <items>
      <name>АвтоГРАФ</name>
      <description>АвтоГРАФ 4</description>
    </items>
    <items>
      <name>АвтоГРАФ5</name>
      <description>АвтоГРАФ 5</description>
    </items>
    <items>
      <name>ПСМ</name>
      <description>Подключаемая система мониторинга</description>
    </items>
    <items>
      <name>СКАУТ</name>
      <description>СКАУТ</description>
    </items>
  </predefined>
  <attributes>
    <name>СистемаМониторинга</name>
    <comment>Система мониторинга (уат)</comment>
    <type>
      <types>CatalogRef.уатВнешниеСистемы</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресСервиса</name>
    <comment>Адрес сервиса системы мониторинга (уат)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСистемы</name>
    <comment>Вид системы (уат)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Драйвер</name>
    <comment>Название драйвера ODBC (уат)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяDSN</name>
    <comment>Имя DSN (уат)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяPIPE</name>
    <comment>Имя PIPE (уат)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяБД</name>
    <comment>Имя базы данных (уат)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Логин</name>
    <comment>Логин в системе мониторинга (уат)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <comment>Пароль в системе мониторинга (уат)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ресурс</name>
    <comment>Имя ресурса (уат)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Сервер</name>
    <comment>Имя сервера базы данных (уат)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособПодключения</name>
    <comment>Способ подключения (уат)</comment>
    <type>
      <types>EnumRef.уатСпособПодключенияКOmnicomm</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособРаботы</name>
    <comment>Способ работы (уат)</comment>
    <type>
      <types>EnumRef.уатСпособРаботыСOmnicomm</types>
    </type>
  </attributes>
  <attributes>
    <name>ТокенАвторизации</name>
    <comment>Токен авторизации в системе мониторинга (уат)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСистемаМониторинга</name>
    <comment>Система мониторинга (уат)</comment>
    <type>
      <types>EnumRef.уатСистемаGPS</types>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Версия</name>
    <type>
      <types>EnumRef.уатВерсииАвтоГРАФ</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособРеализацииВебСервиса</name>
    <type>
      <types>EnumRef.уатСпособыРеализацииВебСервиса</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторКлиента</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователя</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КлючАвторизации</name>
    <comment>Ключ авторизации (уат)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛогированиеЗапросов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>АЗС</name>
    <type>
      <types>CatalogRef.уатАЗС</types>
    </type>
  </attributes>
  <attributes>
    <name>АЗССлив</name>
    <type>
      <types>CatalogRef.уатАЗС</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЗаправки</name>
    <type>
      <types>EnumRef.уатВидыДвиженияГСМ</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСлива</name>
    <type>
      <types>EnumRef.уатВидыОперацийСливГСМ</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздаватьЗаправкиГСМ</name>
    <comment>Создавать заправки ГСМ (уат)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздаватьСливыГСМ</name>
    <comment>Создавать сливы ГСМ (уат)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрофильОбмена</name>
    <comment>(уат)</comment>
    <type>
      <types>CatalogRef.уатПрофилиОбменаСВнешнимиСистемами</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнтервалЗапросов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/уатУчетныеЗаписиСистемыМониторинга/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если СоздаватьЗаправкиГСМ
		ИЛИ СоздаватьСливыГСМ Тогда
		ПроверяемыеРеквизиты.Добавить("ПрофильОбмена");
		ПроверяемыеРеквизиты.Добавить("Организация");
		ПроверяемыеРеквизиты.Добавить("Ответственный");
		
		Если СоздаватьЗаправкиГСМ Тогда 
			ПроверяемыеРеквизиты.Добавить("АЗС");
			ПроверяемыеРеквизиты.Добавить("ВидЗаправки");
		КонецЕсли;  
		Если СоздаватьСливыГСМ Тогда    
			ПроверяемыеРеквизиты.Добавить("АЗССлив");
			ПроверяемыеРеквизиты.Добавить("ВидСлива");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
